<a href="https://colab.research.google.com/github/Jwaminju/Algorithm_01/blob/main/Python_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%8B%9C%EA%B0%81%ED%99%94_Python_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%A0%84%EC%B2%98%EB%A6%AC_(2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터 프레임 전처리
- 컬럼, 행 선택
- 결측값 처리

>  결측치는 전처리를 제대로 하지 않으면 추후에 치명적인 문제가 되기도 함


- 데이터 테이블 join

In [18]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(data = {'val0':['a','b', 'c', 'd'], 'val1':[1, 2, 3, 4], 'val2':[11, 12, 13, 14]}, columns=['val0', 'val1', 'val2'], index = ['x0', 'x1', 'x2', 'x3'])
df

   val0  val1  val2
x0    a     1    11
x1    b     2    12
x2    c     3    13
x3    d     4    14

불Boolean방식 인덱싱

In [6]:
df[df['val1']>=10]  # 한 column을 기준으로 행을 선택할 수 있음

Empty DataFrame
Columns: [val0, val1, val2]
Index: []

In [8]:
df.loc[df['val1']>=2, :]

   val0  val1  val2
x1    b     2    12
x2    c     3    13
x3    d     4    14

In [15]:
df.loc[(df['val1']>=2) & (df['val2']>=13), 'results'] = 'GOOD' # 열을 생성하고, 기본적으로 NaN이 추가됨

In [16]:
df

   val0  val1  val2 results
x0    a     1    11     NaN
x1    b     2    12     NaN
x2    c     3    13    GOOD
x3    d     4    14    GOOD

In [19]:
np.where((df['val1']>=2) & (df['val2']>=13), 'GOOD', 'BAD') # 조건이 만족하면 GOOD, 틀리면 BAD : c언어 삼항연산자와 비슷

array(['BAD', 'BAD', 'GOOD', 'GOOD'], dtype='<U4')

In [20]:
df['result3'] = np.where((df['val1']>=2) & (df['val2']>=13), 'GOOD', 'BAD')
df

   val0  val1  val2 results result3
x0    a     1    11     NaN     BAD
x1    b     2    12     NaN     BAD
x2    c     3    13    GOOD    GOOD
x3    d     4    14    GOOD    GOOD

difference 
- 특정 컬럼 제외 후 선택

In [22]:
df

   val0  val1  val2 results result3
x0    a     1    11     NaN     BAD
x1    b     2    12     NaN     BAD
x2    c     3    13    GOOD    GOOD
x3    d     4    14    GOOD    GOOD

In [23]:
df[df.columns.difference(['results'])] # 지운 것 뒤에서 부터 열의 앞으로 순환하며 출력하는 건가?

   result3 val0  val1  val2
x0     BAD    a     1    11
x1     BAD    b     2    12
x2    GOOD    c     3    13
x3    GOOD    d     4    14

In [25]:
df[df.columns.difference(['val0'])] # 그건 아닌듯., 그럼 랜덤?

   result3 results  val1  val2
x0     BAD     NaN     1    11
x1     BAD     NaN     2    12
x2    GOOD    GOOD     3    13
x3    GOOD    GOOD     4    14

contains
- 특정 이름이 포함된 컬럼 제외 후 선택

In [29]:
df.head(1)

   val0  val1  val2 results result3
x0    a     1    11     NaN     BAD

In [30]:
df.columns.str.contains(pat = 'result') # 포함하는 것은 true가 나옴

array([False, False, False,  True,  True])

In [31]:
df.columns.str.contains(pat = 'result') == False

array([ True,  True,  True, False, False])

In [32]:
df.columns[df.columns.str.contains(pat = 'result') == False]

Index(['val0', 'val1', 'val2'], dtype='object')

In [33]:
df[df.columns[df.columns.str.contains(pat = 'result') == False]]

   val0  val1  val2
x0    a     1    11
x1    b     2    12
x2    c     3    13
x3    d     4    14

# 결측치 처리 방법

결측치의 종류
```
1. 완전무작위 결측
   결측값의 발생이 다른 변수들과 아무런 관계가 없는 경우- 전산오류
2. 무작위 결측
   변수의 결측 여부가 다른 변수와 관련이 있는 경우
3. 비무작위 결측
   나머지 모든 상황, 결측 여부가 해당 변수의 값에 의해 결정.
   ex) 우울감이 심한 사람이 우울감 때문에 설문에 응답하지 않은 경우
```
처리 전략 (결측치 비율에 따른)
- 제거: 10% 미만
- 대치 : 10% 미만
- 예측 모델로 다른 값으로 바꾸기: 50% 미만 예측 모델 기반 삭제 
        50% 이상- 해당 컬럼(변수) 자체 제거

**제거**

Listwise-결측치가 있는 행/열은 전부 삭제

Pairwise-행 을 삭제

In [34]:
df

   val0  val1  val2 results result3
x0    a     1    11     NaN     BAD
x1    b     2    12     NaN     BAD
x2    c     3    13    GOOD    GOOD
x3    d     4    14    GOOD    GOOD

In [37]:
df.loc['x4'] = np.nan
df

   val0  val1  val2 results result3  x4
x0    a   1.0  11.0     NaN     BAD NaN
x1    b   2.0  12.0     NaN     BAD NaN
x2    c   3.0  13.0    GOOD    GOOD NaN
x3    d   4.0  14.0    GOOD    GOOD NaN
x4  NaN   NaN   NaN     NaN     NaN NaN

In [38]:
df.loc[:, 'val3'] = np.nan
df

   val0  val1  val2 results result3  x4  val3
x0    a   1.0  11.0     NaN     BAD NaN   NaN
x1    b   2.0  12.0     NaN     BAD NaN   NaN
x2    c   3.0  13.0    GOOD    GOOD NaN   NaN
x3    d   4.0  14.0    GOOD    GOOD NaN   NaN
x4  NaN   NaN   NaN     NaN     NaN NaN   NaN

결측치 확인

In [39]:
df.isnull()

     val0   val1   val2  results  result3    x4  val3
x0  False  False  False     True    False  True  True
x1  False  False  False     True    False  True  True
x2  False  False  False    False    False  True  True
x3  False  False  False    False    False  True  True
x4   True   True   True     True     True  True  True

In [41]:
df.isnull().sum() # 컬럼별로

val0       1
val1       1
val2       1
results    3
result3    1
x4         5
val3       5
dtype: int64

In [42]:
df.isnull().sum(1) # index 기준

x0    3
x1    3
x2    2
x3    2
x4    7
dtype: int64

제거: dropna(), drop()

In [47]:
df.dropna(how = 'all', axis = 1)

   val0  val1  val2 results result3
x0    a   1.0  11.0     NaN     BAD
x1    b   2.0  12.0     NaN     BAD
x2    c   3.0  13.0    GOOD    GOOD
x3    d   4.0  14.0    GOOD    GOOD
x4  NaN   NaN   NaN     NaN     NaN

In [48]:
df.dropna(how = 'all', axis = 0)

   val0  val1  val2 results result3  x4  val3
x0    a   1.0  11.0     NaN     BAD NaN   NaN
x1    b   2.0  12.0     NaN     BAD NaN   NaN
x2    c   3.0  13.0    GOOD    GOOD NaN   NaN
x3    d   4.0  14.0    GOOD    GOOD NaN   NaN

In [49]:
df.dropna(how = 'any', axis = 1)

Empty DataFrame
Columns: []
Index: [x0, x1, x2, x3, x4]

In [54]:
df.dropna(how = 'any', axis = 0)

Empty DataFrame
Columns: [val0, val1, val2, results, result3, x4, val3]
Index: []

임계치 삭제: thresh (n개 이상 결측값이 아닌 값이 있는 행/열 선택)

In [58]:
df.dropna(thresh=4)

   val0  val1  val2 results result3  x4  val3
x0    a   1.0  11.0     NaN     BAD NaN   NaN
x1    b   2.0  12.0     NaN     BAD NaN   NaN
x2    c   3.0  13.0    GOOD    GOOD NaN   NaN
x3    d   4.0  14.0    GOOD    GOOD NaN   NaN

제거를 원본 데이터에 적용할 때: implace

In [59]:
df.dropna(how = 'all', axis = 0, inplace=True)
df

   val0  val1  val2 results result3  x4  val3
x0    a   1.0  11.0     NaN     BAD NaN   NaN
x1    b   2.0  12.0     NaN     BAD NaN   NaN
x2    c   3.0  13.0    GOOD    GOOD NaN   NaN
x3    d   4.0  14.0    GOOD    GOOD NaN   NaN

In [61]:
df.dropna(how = 'all', axis = 1, inplace=True)
df

   val0  val1  val2 results result3
x0    a   1.0  11.0     NaN     BAD
x1    b   2.0  12.0     NaN     BAD
x2    c   3.0  13.0    GOOD    GOOD
x3    d   4.0  14.0    GOOD    GOOD

drop(): 전체 삭제

In [84]:
df

     val0  val1  val2 results result3  val3  val4
x0      a   1.0  11.0     NaN     BAD   2.5   NaN
x1      b   2.0  12.0     NaN     BAD   2.5   NaN
x2      c   3.0  13.0    GOOD    GOOD   2.5   NaN
x3      d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3  NaN   NaN   NaN     NaN     NaN   2.5   NaN

In [85]:
df.drop('val4', axis = 1)

     val0  val1  val2 results result3  val3
x0      a   1.0  11.0     NaN     BAD   2.5
x1      b   2.0  12.0     NaN     BAD   2.5
x2      c   3.0  13.0    GOOD    GOOD   2.5
x3      d   4.0  14.0    GOOD    GOOD   2.5
val3  NaN   NaN   NaN     NaN     NaN   2.5

In [86]:
df.drop(['val2','val3'], axis = 1)

     val0  val1 results result3  val4
x0      a   1.0     NaN     BAD   NaN
x1      b   2.0     NaN     BAD   NaN
x2      c   3.0    GOOD    GOOD   NaN
x3      d   4.0    GOOD    GOOD   NaN
val3  NaN   NaN     NaN     NaN   NaN

In [87]:
df.drop(df.index[0], axis = 0)

     val0  val1  val2 results result3  val3  val4
x1      b   2.0  12.0     NaN     BAD   2.5   NaN
x2      c   3.0  13.0    GOOD    GOOD   2.5   NaN
x3      d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3  NaN   NaN   NaN     NaN     NaN   2.5   NaN

In [88]:
df.drop(df.index[0:3], axis = 0)

     val0  val1  val2 results result3  val3  val4
x3      d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3  NaN   NaN   NaN     NaN     NaN   2.5   NaN

**대치** - 비슷한 아이디어? ( 최초 적재, 최소적재, 최적 적재 ) 

최빈값

중앙값

평균

In [63]:
df.fillna(value=0)

   val0  val1  val2 results result3
x0    a   1.0  11.0       0     BAD
x1    b   2.0  12.0       0     BAD
x2    c   3.0  13.0    GOOD    GOOD
x3    d   4.0  14.0    GOOD    GOOD

In [64]:
df['val1'].mean()

2.5

In [65]:
df.fillna(value=df['val1'].mean())

   val0  val1  val2 results result3
x0    a   1.0  11.0     2.5     BAD
x1    b   2.0  12.0     2.5     BAD
x2    c   3.0  13.0    GOOD    GOOD
x3    d   4.0  14.0    GOOD    GOOD

In [67]:
df['val1'].fillna(value=df['val1'].mean())

x0    1.0
x1    2.0
x2    3.0
x3    4.0
Name: val1, dtype: float64

In [72]:
df.loc[:,'val3'] = np.nan

In [73]:
df

     val0  val1  val2 results result3  val3
x0      a   1.0  11.0     NaN     BAD   NaN
x1      b   2.0  12.0     NaN     BAD   NaN
x2      c   3.0  13.0    GOOD    GOOD   NaN
x3      d   4.0  14.0    GOOD    GOOD   NaN
val3  NaN   NaN   NaN     NaN     NaN   NaN

In [76]:
df['val3'] = df['val3'].fillna(value=df['val1'].mean())

In [77]:
df

     val0  val1  val2 results result3  val3
x0      a   1.0  11.0     NaN     BAD   2.5
x1      b   2.0  12.0     NaN     BAD   2.5
x2      c   3.0  13.0    GOOD    GOOD   2.5
x3      d   4.0  14.0    GOOD    GOOD   2.5
val3  NaN   NaN   NaN     NaN     NaN   2.5

In [82]:
del df['val4']

KeyError: ignored

In [83]:
df['val4'] = np.nan
df

     val0  val1  val2 results result3  val3  val4
x0      a   1.0  11.0     NaN     BAD   2.5   NaN
x1      b   2.0  12.0     NaN     BAD   2.5   NaN
x2      c   3.0  13.0    GOOD    GOOD   2.5   NaN
x3      d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3  NaN   NaN   NaN     NaN     NaN   2.5   NaN

# Join(merge 함수 사용)
left, right, inner, outer

left: 왼쪽 데이터프레임을 기준으로 조인한다. 오르쪽 데이터프레임에 없는 값은 NaN으로 나타난다.(결측치)

In [89]:
data_A = {'ID': [1, 2, 3], 'name' : ['Kim', 'Choi', 'Lee']}
df_A = pd.DataFrame(data_A, columns = ['ID', 'name'])

data_B = {'ID': [2, 3, 4], 'age' : [33, 15, 20]}
df_B = pd.DataFrame(data_B, columns = ['ID', 'age'])

In [90]:
df_A

   ID  name
0   1   Kim
1   2  Choi
2   3   Lee

In [91]:
df_B

   ID  age
0   2   33
1   3   15
2   4   20

In [92]:
df_inner = pd.merge(df_A, df_B, on='ID', how='inner')
df_inner

   ID  name  age
0   2  Choi   33
1   3   Lee   15

In [94]:
df_outer = pd.merge(df_A, df_B, on='ID', how='outer')
df_outer

   ID  name   age
0   1   Kim   NaN
1   2  Choi  33.0
2   3   Lee  15.0
3   4   NaN  20.0

In [95]:
df_left = pd.merge(df_A, df_B, on='ID', how='left')
df_left

   ID  name   age
0   1   Kim   NaN
1   2  Choi  33.0
2   3   Lee  15.0

In [96]:
df_right = pd.merge(df_A, df_B, on='ID', how='right')
df_right

   ID  name  age
0   2  Choi   33
1   3   Lee   15
2   4   NaN   20

In [97]:
df_inner = pd.merge(df_A, df_B) # default는 inner, 그리고 on은 동일한 컬럼명칭
df_inner

   ID  name  age
0   2  Choi   33
1   3   Lee   15

In [98]:
df

     val0  val1  val2 results result3  val3  val4
x0      a   1.0  11.0     NaN     BAD   2.5   NaN
x1      b   2.0  12.0     NaN     BAD   2.5   NaN
x2      c   3.0  13.0    GOOD    GOOD   2.5   NaN
x3      d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3  NaN   NaN   NaN     NaN     NaN   2.5   NaN

In [102]:
df['val0'] = np.where(df['val0']=='a', 'Washer', df['val0'])
df

        val0  val1  val2 results result3  val3  val4
x0    Washer   1.0  11.0     NaN     BAD   2.5   NaN
x1         b   2.0  12.0     NaN     BAD   2.5   NaN
x2         c   3.0  13.0    GOOD    GOOD   2.5   NaN
x3         d   4.0  14.0    GOOD    GOOD   2.5   NaN
val3     NaN   NaN   NaN     NaN     NaN   2.5   NaN

참고로, 고유키와 코드는 숫자형보다 문자형으로 두는게 좋다

In [103]:
# np.where을 사용하는 것도 좋지만, 원래 join전 데이터 프레임에 없는 정보를 추가한 후 다시 join하면 한 꺼번에 바꿀 수 있음.

정렬

In [105]:
df['sort'] = [4, 3, 2, 1, 0]
df

        val0  val1  val2 results result3  val3  val4  sort
x0    Washer   1.0  11.0     NaN     BAD   2.5   NaN     4
x1         b   2.0  12.0     NaN     BAD   2.5   NaN     3
x2         c   3.0  13.0    GOOD    GOOD   2.5   NaN     2
x3         d   4.0  14.0    GOOD    GOOD   2.5   NaN     1
val3     NaN   NaN   NaN     NaN     NaN   2.5   NaN     0

In [106]:
df.sort_values(by='sort')

        val0  val1  val2 results result3  val3  val4  sort
val3     NaN   NaN   NaN     NaN     NaN   2.5   NaN     0
x3         d   4.0  14.0    GOOD    GOOD   2.5   NaN     1
x2         c   3.0  13.0    GOOD    GOOD   2.5   NaN     2
x1         b   2.0  12.0     NaN     BAD   2.5   NaN     3
x0    Washer   1.0  11.0     NaN     BAD   2.5   NaN     4